In [1]:
import pandas as pd

In [2]:
l=["Mathematics","Physics","Chemistry","History","Geography","German"]
s1=pd.Series(l)
m=[98,95,56,58,100]
s2=pd.Series(m)
df=pd.DataFrame({"Subjects":s1,"Marks":s2})

In [10]:
df.head()

      Subjects  Marks
0  Mathematics   98.0
1      Physics   95.0
2    Chemistry   56.0
3      History   58.0
4    Geography  100.0

In [11]:
df.tail()

    Subjects  Marks
1    Physics   95.0
2  Chemistry   56.0
3    History   58.0
4  Geography  100.0
5     German    NaN

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Subjects  6 non-null      object
 1   Marks     5 non-null      float64
dtypes: float64(1), object(1)
memory usage: 224.0+ bytes